tutorials/multiphaseTransport/interTransportFoam/2DthroatMultiphaseTransport/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-4;

vertices        
(
    (0 0 0)//0
    (8 0 0)//1
    (8 0.16 0)//2
    (0 0.16 0)//3
    (0 0 1)//4
    (8 0 1)//5
    (8 0.16 1)//6
    (0 0.16 1)//7

    (8 0.84 0)//8
    (0 0.84 0)//9
    (8 0.84 1)//10
    (0 0.84 1)//11

    (8 1 0)//12
    (0 1 0)//13
    (8 1 1)//14
    (0 1 1)//15

);

blocks          
(
        hex (0 1 2 3 4 5 6 7) (200 10 1) simpleGrading (1 4 1)
        hex (3 2 8 9 7 6 10 11) (200 16 1) simpleGrading (1 1 1)
        hex (9 8 12 13 11 10 14 15) (200 10 1) simpleGrading (1 0.25 1)
);

edges           
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (13 15 14 12)
        );
    }
    inlet
    {
		type patch;
		faces
		(
	    	(0 4 7 3)
			(3 7 11 9)
	    	(9 11 15 13)
		);
    } 
    outlet
    {
		type patch;
		faces
		(
	   	(1 2 6 5)
	   	(2 8 10 6)
	   	(8 12 14 10)
		);
    }
    frontandback
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (3 9 8 2)
            (7 6 10 11)
            (9 13 12 8)
            (11 10 14 15)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
