tutorials/multiphaseTransport/interTransportFoam/2DthroatMultiphaseTransport/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interTransportFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2.5e-3;

deltaT          1e-8;

writeControl    adjustableRunTime;

writeInterval   2e-5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.1;

maxDeltaT       1e-7; 

libs ("libfiniteVolumeGCFOAM.so""libreactionThermophysicalModelsGCFOAM.so");

// ************************************************************************* //
