tutorials/multiphaseTransport/interTransportFoam/2DthroatMultiphaseTransport/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha1 0
    volScalarFieldValue T 0 
);

regions
(
    boxToCell
    {
        box (0 0 0) (4e-5 2e-3 2e-3);
        fieldValues
        (
            volScalarFieldValue alpha1 1
            volScalarFieldValue T 1 
        );
    }
);

// ************************************************************************* //
